tutorials/artery flow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }
    
    PotE
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.01;
    }

    PotEFinal
    {
        $PotE;
        relTol          0;
    }

    "(N|U)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }
    
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PotE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    PotERefCell     0;
    PotERefValue    0;
}

// ************************************************************************* //
